rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_AES_ACCEL.h
/*
** ###################################################################
**     Processor:           S32K388_M7
**     Reference manual:    S32K3xx RM Rev.8 Draft B
**     Version:             rev. 1.3, 2023-09-12
**     Build:               b230922
**
**     Abstract:
**         Peripheral Access Layer for S32K388_M7
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2023 NXP
**
**     NXP Confidential and Proprietary. This software is owned or controlled
**     by NXP and may only be used strictly in accordance with the applicable
**     license terms. By expressly accepting such terms or by downloading,
**     installing, activating and/or otherwise using the software, you are
**     agreeing that you have read, and that you agree to comply with and are
**     bound by, such license terms. If you do not agree to be bound by the
**     applicable license terms, then you may not retain, install, activate
**     or otherwise use the software.
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
** ###################################################################
*/

/*!
 * @file S32K388_AES_ACCEL.h
 * @version 1.3
 * @date 2023-09-12
 * @brief Peripheral Access Layer for S32K388_AES_ACCEL
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K388_AES_ACCEL_H_)  /* Check if memory map has not been already included */
#define S32K388_AES_ACCEL_H_

#include "S32K388_COMMON.h"

/* ----------------------------------------------------------------------------
   -- AES_ACCEL Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup AES_ACCEL_Peripheral_Access_Layer AES_ACCEL Peripheral Access Layer
 * @{
 */

/** AES_ACCEL - Register Layout Typedef */
typedef struct {
  __IO uint32_t LEN0;                              /**< LEN, offset: 0x0 */
  __IO uint32_t AILEN0;                            /**< AAD/IV length, offset: 0x4 */
  __IO uint32_t CRYPT0;                            /**< CRYPT, offset: 0x8 */
  __I  uint32_t OWNSTAT0;                          /**< OWN_Status, offset: 0xC */
  __IO uint32_t TLVAL0;                            /**< Timer Load Value, offset: 0x10 */
  __I  uint32_t CVAL0;                             /**< Current Timer Value, offset: 0x14 */
  __IO uint32_t TCTRL0;                            /**< Timer Control, offset: 0x18 */
  __IO uint32_t TFLG0;                             /**< Timer Flag, offset: 0x1C */
  __IO uint32_t FEEDINTMAP0;                       /**< FEEDINTMAP, offset: 0x20 */
  __IO uint32_t RESULTINTMAP0;                     /**< RESULTINTMAP, offset: 0x24 */
  uint8_t RESERVED_0[65496];
  __IO uint32_t LEN1;                              /**< LEN, offset: 0x10000 */
  __IO uint32_t AILEN1;                            /**< AAD/IV length, offset: 0x10004 */
  __IO uint32_t CRYPT1;                            /**< CRYPT, offset: 0x10008 */
  __I  uint32_t OWNSTAT1;                          /**< OWN_Status, offset: 0x1000C */
  __IO uint32_t TLVAL1;                            /**< Timer Load Value, offset: 0x10010 */
  __I  uint32_t CVAL1;                             /**< Current Timer Value, offset: 0x10014 */
  __IO uint32_t TCTRL1;                            /**< Timer Control, offset: 0x10018 */
  __IO uint32_t TFLG1;                             /**< Timer Flag, offset: 0x1001C */
  __IO uint32_t FEEDINTMAP1;                       /**< FEEDINTMAP, offset: 0x10020 */
  __IO uint32_t RESULTINTMAP1;                     /**< RESULTINTMAP, offset: 0x10024 */
  uint8_t RESERVED_1[65496];
  __IO uint32_t LEN2;                              /**< LEN, offset: 0x20000 */
  __IO uint32_t AILEN2;                            /**< AAD/IV length, offset: 0x20004 */
  __IO uint32_t CRYPT2;                            /**< CRYPT, offset: 0x20008 */
  __I  uint32_t OWNSTAT2;                          /**< OWN_Status, offset: 0x2000C */
  __IO uint32_t TLVAL2;                            /**< Timer Load Value, offset: 0x20010 */
  __I  uint32_t CVAL2;                             /**< Current Timer Value, offset: 0x20014 */
  __IO uint32_t TCTRL2;                            /**< Timer Control, offset: 0x20018 */
  __IO uint32_t TFLG2;                             /**< Timer Flag, offset: 0x2001C */
  __IO uint32_t FEEDINTMAP2;                       /**< FEEDINTMAP, offset: 0x20020 */
  __IO uint32_t RESULTINTMAP2;                     /**< RESULTINTMAP, offset: 0x20024 */
  uint8_t RESERVED_2[1245144];
  __IO uint32_t LEN3;                              /**< LEN, offset: 0x150000 */
  __IO uint32_t AILEN3;                            /**< AAD/IV length, offset: 0x150004 */
  __IO uint32_t CRYPT3;                            /**< CRYPT, offset: 0x150008 */
  __I  uint32_t OWNSTAT3;                          /**< OWN_Status, offset: 0x15000C */
  __IO uint32_t TLVAL3;                            /**< Timer Load Value, offset: 0x150010 */
  __I  uint32_t CVAL3;                             /**< Current Timer Value, offset: 0x150014 */
  __IO uint32_t TCTRL3;                            /**< Timer Control, offset: 0x150018 */
  __IO uint32_t TFLG3;                             /**< Timer Flag, offset: 0x15001C */
  __IO uint32_t FEEDINTMAP3;                       /**< FEEDINTMAP, offset: 0x150020 */
  __IO uint32_t RESULTINTMAP3;                     /**< RESULTINTMAP, offset: 0x150024 */
  uint8_t RESERVED_3[65496];
  __IO uint32_t LEN4;                              /**< LEN, offset: 0x160000 */
  __IO uint32_t AILEN4;                            /**< AAD/IV length, offset: 0x160004 */
  __IO uint32_t CRYPT4;                            /**< CRYPT, offset: 0x160008 */
  __I  uint32_t OWNSTAT4;                          /**< OWN_Status, offset: 0x16000C */
  __IO uint32_t TLVAL4;                            /**< Timer Load Value, offset: 0x160010 */
  __I  uint32_t CVAL4;                             /**< Current Timer Value, offset: 0x160014 */
  __IO uint32_t TCTRL4;                            /**< Timer Control, offset: 0x160018 */
  __IO uint32_t TFLG4;                             /**< Timer Flag, offset: 0x16001C */
  __IO uint32_t FEEDINTMAP4;                       /**< FEEDINTMAP, offset: 0x160020 */
  __IO uint32_t RESULTINTMAP4;                     /**< RESULTINTMAP, offset: 0x160024 */
  uint8_t RESERVED_4[65496];
  __IO uint32_t LEN5;                              /**< LEN, offset: 0x170000 */
  __IO uint32_t AILEN5;                            /**< AAD/IV length, offset: 0x170004 */
  __IO uint32_t CRYPT5;                            /**< CRYPT, offset: 0x170008 */
  __I  uint32_t OWNSTAT5;                          /**< OWN_Status, offset: 0x17000C */
  __IO uint32_t TLVAL5;                            /**< Timer Load Value, offset: 0x170010 */
  __I  uint32_t CVAL5;                             /**< Current Timer Value, offset: 0x170014 */
  __IO uint32_t TCTRL5;                            /**< Timer Control, offset: 0x170018 */
  __IO uint32_t TFLG5;                             /**< Timer Flag, offset: 0x17001C */
  __IO uint32_t FEEDINTMAP5;                       /**< FEEDINTMAP, offset: 0x170020 */
  __IO uint32_t RESULTINTMAP5;                     /**< RESULTINTMAP, offset: 0x170024 */
  uint8_t RESERVED_5[65496];
  __IO uint32_t LEN6;                              /**< LEN, offset: 0x180000 */
  __IO uint32_t AILEN6;                            /**< AAD/IV length, offset: 0x180004 */
  __IO uint32_t CRYPT6;                            /**< CRYPT, offset: 0x180008 */
  __I  uint32_t OWNSTAT6;                          /**< OWN_Status, offset: 0x18000C */
  __IO uint32_t TLVAL6;                            /**< Timer Load Value, offset: 0x180010 */
  __I  uint32_t CVAL6;                             /**< Current Timer Value, offset: 0x180014 */
  __IO uint32_t TCTRL6;                            /**< Timer Control, offset: 0x180018 */
  __IO uint32_t TFLG6;                             /**< Timer Flag, offset: 0x18001C */
  __IO uint32_t FEEDINTMAP6;                       /**< FEEDINTMAP, offset: 0x180020 */
  __IO uint32_t RESULTINTMAP6;                     /**< RESULTINTMAP, offset: 0x180024 */
  uint8_t RESERVED_6[65496];
  __IO uint32_t LEN7;                              /**< LEN, offset: 0x190000 */
  __IO uint32_t AILEN7;                            /**< AAD/IV length, offset: 0x190004 */
  __IO uint32_t CRYPT7;                            /**< CRYPT, offset: 0x190008 */
  __I  uint32_t OWNSTAT7;                          /**< OWN_Status, offset: 0x19000C */
  __IO uint32_t TLVAL7;                            /**< Timer Load Value, offset: 0x190010 */
  __I  uint32_t CVAL7;                             /**< Current Timer Value, offset: 0x190014 */
  __IO uint32_t TCTRL7;                            /**< Timer Control, offset: 0x190018 */
  __IO uint32_t TFLG7;                             /**< Timer Flag, offset: 0x19001C */
  __IO uint32_t FEEDINTMAP7;                       /**< FEEDINTMAP, offset: 0x190020 */
  __IO uint32_t RESULTINTMAP7;                     /**< RESULTINTMAP, offset: 0x190024 */
} AES_ACCEL_Type, *AES_ACCEL_MemMapPtr;

