rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_AES_ACCEL.h
/** Number of instances of the AES_ACCEL module. */
#define AES_ACCEL_INSTANCE_COUNT                 (1u)

/* AES_ACCEL - Peripheral instance base addresses */
/** Peripheral AES_ACCEL base address */
#define IP_AES_ACCEL_BASE                        (0x403D0000u)
/** Peripheral AES_ACCEL base pointer */
#define IP_AES_ACCEL                             ((AES_ACCEL_Type *)IP_AES_ACCEL_BASE)
/** Array initializer of AES_ACCEL peripheral base addresses */
#define IP_AES_ACCEL_BASE_ADDRS                  { IP_AES_ACCEL_BASE }
/** Array initializer of AES_ACCEL peripheral base pointers */
#define IP_AES_ACCEL_BASE_PTRS                   { IP_AES_ACCEL }

/* ----------------------------------------------------------------------------
   -- AES_ACCEL Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup AES_ACCEL_Register_Masks AES_ACCEL Register Masks
 * @{
 */

/*! @name LEN0 - LEN */
/*! @{ */

#define AES_ACCEL_LEN0_TLEN_MASK                 (0x7FFFFU)
#define AES_ACCEL_LEN0_TLEN_SHIFT                (0U)
#define AES_ACCEL_LEN0_TLEN_WIDTH                (19U)
#define AES_ACCEL_LEN0_TLEN(x)                   (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_LEN0_TLEN_SHIFT)) & AES_ACCEL_LEN0_TLEN_MASK)
/*! @} */

/*! @name AILEN0 - AAD/IV length */
/*! @{ */

#define AES_ACCEL_AILEN0_AAD_MASK                (0x7FFFFU)
#define AES_ACCEL_AILEN0_AAD_SHIFT               (0U)
#define AES_ACCEL_AILEN0_AAD_WIDTH               (19U)
#define AES_ACCEL_AILEN0_AAD(x)                  (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_AILEN0_AAD_SHIFT)) & AES_ACCEL_AILEN0_AAD_MASK)

#define AES_ACCEL_AILEN0_IVLEN_MASK              (0x7F000000U)
#define AES_ACCEL_AILEN0_IVLEN_SHIFT             (24U)
#define AES_ACCEL_AILEN0_IVLEN_WIDTH             (7U)
#define AES_ACCEL_AILEN0_IVLEN(x)                (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_AILEN0_IVLEN_SHIFT)) & AES_ACCEL_AILEN0_IVLEN_MASK)
/*! @} */

/*! @name CRYPT0 - CRYPT */
/*! @{ */

#define AES_ACCEL_CRYPT0_MASK_MASK               (0x7FU)
#define AES_ACCEL_CRYPT0_MASK_SHIFT              (0U)
#define AES_ACCEL_CRYPT0_MASK_WIDTH              (7U)
#define AES_ACCEL_CRYPT0_MASK(x)                 (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_CRYPT0_MASK_SHIFT)) & AES_ACCEL_CRYPT0_MASK_MASK)

#define AES_ACCEL_CRYPT0_CMODE_MASK              (0xF00U)
#define AES_ACCEL_CRYPT0_CMODE_SHIFT             (8U)
#define AES_ACCEL_CRYPT0_CMODE_WIDTH             (4U)
#define AES_ACCEL_CRYPT0_CMODE(x)                (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_CRYPT0_CMODE_SHIFT)) & AES_ACCEL_CRYPT0_CMODE_MASK)

#define AES_ACCEL_CRYPT0_CO_MASK                 (0x3000U)
#define AES_ACCEL_CRYPT0_CO_SHIFT                (12U)
#define AES_ACCEL_CRYPT0_CO_WIDTH                (2U)
#define AES_ACCEL_CRYPT0_CO(x)                   (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_CRYPT0_CO_SHIFT)) & AES_ACCEL_CRYPT0_CO_MASK)

#define AES_ACCEL_CRYPT0_KSLOT_MASK              (0x7F0000U)
#define AES_ACCEL_CRYPT0_KSLOT_SHIFT             (16U)
#define AES_ACCEL_CRYPT0_KSLOT_WIDTH             (7U)
#define AES_ACCEL_CRYPT0_KSLOT(x)                (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_CRYPT0_KSLOT_SHIFT)) & AES_ACCEL_CRYPT0_KSLOT_MASK)
/*! @} */

/*! @name OWNSTAT0 - OWN_Status */
/*! @{ */

#define AES_ACCEL_OWNSTAT0_DID_MASK              (0xFU)
#define AES_ACCEL_OWNSTAT0_DID_SHIFT             (0U)
#define AES_ACCEL_OWNSTAT0_DID_WIDTH             (4U)
#define AES_ACCEL_OWNSTAT0_DID(x)                (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_OWNSTAT0_DID_SHIFT)) & AES_ACCEL_OWNSTAT0_DID_MASK)

#define AES_ACCEL_OWNSTAT0_NS_MASK               (0x40U)
#define AES_ACCEL_OWNSTAT0_NS_SHIFT              (6U)
#define AES_ACCEL_OWNSTAT0_NS_WIDTH              (1U)
#define AES_ACCEL_OWNSTAT0_NS(x)                 (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_OWNSTAT0_NS_SHIFT)) & AES_ACCEL_OWNSTAT0_NS_MASK)

#define AES_ACCEL_OWNSTAT0_PRIV_MASK             (0x80U)
#define AES_ACCEL_OWNSTAT0_PRIV_SHIFT            (7U)
#define AES_ACCEL_OWNSTAT0_PRIV_WIDTH            (1U)
#define AES_ACCEL_OWNSTAT0_PRIV(x)               (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_OWNSTAT0_PRIV_SHIFT)) & AES_ACCEL_OWNSTAT0_PRIV_MASK)
/*! @} */

/*! @name TLVAL0 - Timer Load Value */
/*! @{ */

#define AES_ACCEL_TLVAL0_TSV_MASK                (0xFFFFU)
#define AES_ACCEL_TLVAL0_TSV_SHIFT               (0U)
#define AES_ACCEL_TLVAL0_TSV_WIDTH               (16U)
#define AES_ACCEL_TLVAL0_TSV(x)                  (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_TLVAL0_TSV_SHIFT)) & AES_ACCEL_TLVAL0_TSV_MASK)
/*! @} */

/*! @name CVAL0 - Current Timer Value */
/*! @{ */

#define AES_ACCEL_CVAL0_TVL_MASK                 (0xFFFFU)
#define AES_ACCEL_CVAL0_TVL_SHIFT                (0U)
#define AES_ACCEL_CVAL0_TVL_WIDTH                (16U)
#define AES_ACCEL_CVAL0_TVL(x)                   (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_CVAL0_TVL_SHIFT)) & AES_ACCEL_CVAL0_TVL_MASK)
/*! @} */

/*! @name TCTRL0 - Timer Control */
/*! @{ */

#define AES_ACCEL_TCTRL0_TEN_MASK                (0x1U)
#define AES_ACCEL_TCTRL0_TEN_SHIFT               (0U)
#define AES_ACCEL_TCTRL0_TEN_WIDTH               (1U)
#define AES_ACCEL_TCTRL0_TEN(x)                  (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_TCTRL0_TEN_SHIFT)) & AES_ACCEL_TCTRL0_TEN_MASK)

#define AES_ACCEL_TCTRL0_TIE_MASK                (0x2U)
#define AES_ACCEL_TCTRL0_TIE_SHIFT               (1U)
#define AES_ACCEL_TCTRL0_TIE_WIDTH               (1U)
#define AES_ACCEL_TCTRL0_TIE(x)                  (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_TCTRL0_TIE_SHIFT)) & AES_ACCEL_TCTRL0_TIE_MASK)

#define AES_ACCEL_TCTRL0_FRZ_MASK                (0x4U)
#define AES_ACCEL_TCTRL0_FRZ_SHIFT               (2U)
#define AES_ACCEL_TCTRL0_FRZ_WIDTH               (1U)
#define AES_ACCEL_TCTRL0_FRZ(x)                  (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_TCTRL0_FRZ_SHIFT)) & AES_ACCEL_TCTRL0_FRZ_MASK)
/*! @} */

/*! @name TFLG0 - Timer Flag */
/*! @{ */

#define AES_ACCEL_TFLG0_TIF_MASK                 (0x1U)
#define AES_ACCEL_TFLG0_TIF_SHIFT                (0U)
#define AES_ACCEL_TFLG0_TIF_WIDTH                (1U)
#define AES_ACCEL_TFLG0_TIF(x)                   (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_TFLG0_TIF_SHIFT)) & AES_ACCEL_TFLG0_TIF_MASK)
/*! @} */

/*! @name FEEDINTMAP0 - FEEDINTMAP */
/*! @{ */

#define AES_ACCEL_FEEDINTMAP0_FIEN0_MASK         (0x1U)
#define AES_ACCEL_FEEDINTMAP0_FIEN0_SHIFT        (0U)
#define AES_ACCEL_FEEDINTMAP0_FIEN0_WIDTH        (1U)
#define AES_ACCEL_FEEDINTMAP0_FIEN0(x)           (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_FEEDINTMAP0_FIEN0_SHIFT)) & AES_ACCEL_FEEDINTMAP0_FIEN0_MASK)

