rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_AES_ACCEL.h
#define AES_ACCEL_FEEDINTMAP0_FIEN8_MASK         (0x2U)
#define AES_ACCEL_FEEDINTMAP0_FIEN8_SHIFT        (1U)
#define AES_ACCEL_FEEDINTMAP0_FIEN8_WIDTH        (1U)
#define AES_ACCEL_FEEDINTMAP0_FIEN8(x)           (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_FEEDINTMAP0_FIEN8_SHIFT)) & AES_ACCEL_FEEDINTMAP0_FIEN8_MASK)

#define AES_ACCEL_FEEDINTMAP0_FIEN16_MASK        (0x4U)
#define AES_ACCEL_FEEDINTMAP0_FIEN16_SHIFT       (2U)
#define AES_ACCEL_FEEDINTMAP0_FIEN16_WIDTH       (1U)
#define AES_ACCEL_FEEDINTMAP0_FIEN16(x)          (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_FEEDINTMAP0_FIEN16_SHIFT)) & AES_ACCEL_FEEDINTMAP0_FIEN16_MASK)

#define AES_ACCEL_FEEDINTMAP0_FIEN24_MASK        (0x8U)
#define AES_ACCEL_FEEDINTMAP0_FIEN24_SHIFT       (3U)
#define AES_ACCEL_FEEDINTMAP0_FIEN24_WIDTH       (1U)
#define AES_ACCEL_FEEDINTMAP0_FIEN24(x)          (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_FEEDINTMAP0_FIEN24_SHIFT)) & AES_ACCEL_FEEDINTMAP0_FIEN24_MASK)
/*! @} */

/*! @name RESULTINTMAP0 - RESULTINTMAP */
/*! @{ */

#define AES_ACCEL_RESULTINTMAP0_RIEN0_MASK       (0x1U)
#define AES_ACCEL_RESULTINTMAP0_RIEN0_SHIFT      (0U)
#define AES_ACCEL_RESULTINTMAP0_RIEN0_WIDTH      (1U)
#define AES_ACCEL_RESULTINTMAP0_RIEN0(x)         (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_RESULTINTMAP0_RIEN0_SHIFT)) & AES_ACCEL_RESULTINTMAP0_RIEN0_MASK)

#define AES_ACCEL_RESULTINTMAP0_RIEN8_MASK       (0x2U)
#define AES_ACCEL_RESULTINTMAP0_RIEN8_SHIFT      (1U)
#define AES_ACCEL_RESULTINTMAP0_RIEN8_WIDTH      (1U)
#define AES_ACCEL_RESULTINTMAP0_RIEN8(x)         (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_RESULTINTMAP0_RIEN8_SHIFT)) & AES_ACCEL_RESULTINTMAP0_RIEN8_MASK)

#define AES_ACCEL_RESULTINTMAP0_RIEN16_MASK      (0x4U)
#define AES_ACCEL_RESULTINTMAP0_RIEN16_SHIFT     (2U)
#define AES_ACCEL_RESULTINTMAP0_RIEN16_WIDTH     (1U)
#define AES_ACCEL_RESULTINTMAP0_RIEN16(x)        (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_RESULTINTMAP0_RIEN16_SHIFT)) & AES_ACCEL_RESULTINTMAP0_RIEN16_MASK)
/*! @} */

/*! @name LEN1 - LEN */
/*! @{ */

#define AES_ACCEL_LEN1_TLEN_MASK                 (0x7FFFFU)
#define AES_ACCEL_LEN1_TLEN_SHIFT                (0U)
#define AES_ACCEL_LEN1_TLEN_WIDTH                (19U)
#define AES_ACCEL_LEN1_TLEN(x)                   (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_LEN1_TLEN_SHIFT)) & AES_ACCEL_LEN1_TLEN_MASK)
/*! @} */

/*! @name AILEN1 - AAD/IV length */
/*! @{ */

#define AES_ACCEL_AILEN1_AAD_MASK                (0x7FFFFU)
#define AES_ACCEL_AILEN1_AAD_SHIFT               (0U)
#define AES_ACCEL_AILEN1_AAD_WIDTH               (19U)
#define AES_ACCEL_AILEN1_AAD(x)                  (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_AILEN1_AAD_SHIFT)) & AES_ACCEL_AILEN1_AAD_MASK)

#define AES_ACCEL_AILEN1_IVLEN_MASK              (0x7F000000U)
#define AES_ACCEL_AILEN1_IVLEN_SHIFT             (24U)
#define AES_ACCEL_AILEN1_IVLEN_WIDTH             (7U)
#define AES_ACCEL_AILEN1_IVLEN(x)                (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_AILEN1_IVLEN_SHIFT)) & AES_ACCEL_AILEN1_IVLEN_MASK)
/*! @} */

/*! @name CRYPT1 - CRYPT */
/*! @{ */

#define AES_ACCEL_CRYPT1_MASK_MASK               (0x7FU)
#define AES_ACCEL_CRYPT1_MASK_SHIFT              (0U)
#define AES_ACCEL_CRYPT1_MASK_WIDTH              (7U)
#define AES_ACCEL_CRYPT1_MASK(x)                 (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_CRYPT1_MASK_SHIFT)) & AES_ACCEL_CRYPT1_MASK_MASK)

#define AES_ACCEL_CRYPT1_CMODE_MASK              (0xF00U)
#define AES_ACCEL_CRYPT1_CMODE_SHIFT             (8U)
#define AES_ACCEL_CRYPT1_CMODE_WIDTH             (4U)
#define AES_ACCEL_CRYPT1_CMODE(x)                (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_CRYPT1_CMODE_SHIFT)) & AES_ACCEL_CRYPT1_CMODE_MASK)

#define AES_ACCEL_CRYPT1_CO_MASK                 (0x3000U)
#define AES_ACCEL_CRYPT1_CO_SHIFT                (12U)
#define AES_ACCEL_CRYPT1_CO_WIDTH                (2U)
#define AES_ACCEL_CRYPT1_CO(x)                   (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_CRYPT1_CO_SHIFT)) & AES_ACCEL_CRYPT1_CO_MASK)

#define AES_ACCEL_CRYPT1_KSLOT_MASK              (0x7F0000U)
#define AES_ACCEL_CRYPT1_KSLOT_SHIFT             (16U)
#define AES_ACCEL_CRYPT1_KSLOT_WIDTH             (7U)
#define AES_ACCEL_CRYPT1_KSLOT(x)                (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_CRYPT1_KSLOT_SHIFT)) & AES_ACCEL_CRYPT1_KSLOT_MASK)
/*! @} */

/*! @name OWNSTAT1 - OWN_Status */
/*! @{ */

#define AES_ACCEL_OWNSTAT1_DID_MASK              (0xFU)
#define AES_ACCEL_OWNSTAT1_DID_SHIFT             (0U)
#define AES_ACCEL_OWNSTAT1_DID_WIDTH             (4U)
#define AES_ACCEL_OWNSTAT1_DID(x)                (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_OWNSTAT1_DID_SHIFT)) & AES_ACCEL_OWNSTAT1_DID_MASK)

#define AES_ACCEL_OWNSTAT1_NS_MASK               (0x40U)
#define AES_ACCEL_OWNSTAT1_NS_SHIFT              (6U)
#define AES_ACCEL_OWNSTAT1_NS_WIDTH              (1U)
#define AES_ACCEL_OWNSTAT1_NS(x)                 (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_OWNSTAT1_NS_SHIFT)) & AES_ACCEL_OWNSTAT1_NS_MASK)

#define AES_ACCEL_OWNSTAT1_PRIV_MASK             (0x80U)
#define AES_ACCEL_OWNSTAT1_PRIV_SHIFT            (7U)
#define AES_ACCEL_OWNSTAT1_PRIV_WIDTH            (1U)
#define AES_ACCEL_OWNSTAT1_PRIV(x)               (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_OWNSTAT1_PRIV_SHIFT)) & AES_ACCEL_OWNSTAT1_PRIV_MASK)
/*! @} */

/*! @name TLVAL1 - Timer Load Value */
/*! @{ */

#define AES_ACCEL_TLVAL1_TSV_MASK                (0xFFFFU)
#define AES_ACCEL_TLVAL1_TSV_SHIFT               (0U)
#define AES_ACCEL_TLVAL1_TSV_WIDTH               (16U)
#define AES_ACCEL_TLVAL1_TSV(x)                  (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_TLVAL1_TSV_SHIFT)) & AES_ACCEL_TLVAL1_TSV_MASK)
/*! @} */

/*! @name CVAL1 - Current Timer Value */
/*! @{ */

#define AES_ACCEL_CVAL1_TVL_MASK                 (0xFFFFU)
#define AES_ACCEL_CVAL1_TVL_SHIFT                (0U)
#define AES_ACCEL_CVAL1_TVL_WIDTH                (16U)
#define AES_ACCEL_CVAL1_TVL(x)                   (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_CVAL1_TVL_SHIFT)) & AES_ACCEL_CVAL1_TVL_MASK)
/*! @} */

/*! @name TCTRL1 - Timer Control */
/*! @{ */

#define AES_ACCEL_TCTRL1_TEN_MASK                (0x1U)
#define AES_ACCEL_TCTRL1_TEN_SHIFT               (0U)
#define AES_ACCEL_TCTRL1_TEN_WIDTH               (1U)
#define AES_ACCEL_TCTRL1_TEN(x)                  (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_TCTRL1_TEN_SHIFT)) & AES_ACCEL_TCTRL1_TEN_MASK)

