rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_AES_ACCEL.h
#define AES_ACCEL_TCTRL1_TIE_MASK                (0x2U)
#define AES_ACCEL_TCTRL1_TIE_SHIFT               (1U)
#define AES_ACCEL_TCTRL1_TIE_WIDTH               (1U)
#define AES_ACCEL_TCTRL1_TIE(x)                  (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_TCTRL1_TIE_SHIFT)) & AES_ACCEL_TCTRL1_TIE_MASK)

#define AES_ACCEL_TCTRL1_FRZ_MASK                (0x4U)
#define AES_ACCEL_TCTRL1_FRZ_SHIFT               (2U)
#define AES_ACCEL_TCTRL1_FRZ_WIDTH               (1U)
#define AES_ACCEL_TCTRL1_FRZ(x)                  (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_TCTRL1_FRZ_SHIFT)) & AES_ACCEL_TCTRL1_FRZ_MASK)
/*! @} */

/*! @name TFLG1 - Timer Flag */
/*! @{ */

#define AES_ACCEL_TFLG1_TIF_MASK                 (0x1U)
#define AES_ACCEL_TFLG1_TIF_SHIFT                (0U)
#define AES_ACCEL_TFLG1_TIF_WIDTH                (1U)
#define AES_ACCEL_TFLG1_TIF(x)                   (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_TFLG1_TIF_SHIFT)) & AES_ACCEL_TFLG1_TIF_MASK)
/*! @} */

/*! @name FEEDINTMAP1 - FEEDINTMAP */
/*! @{ */

#define AES_ACCEL_FEEDINTMAP1_FIEN1_MASK         (0x1U)
#define AES_ACCEL_FEEDINTMAP1_FIEN1_SHIFT        (0U)
#define AES_ACCEL_FEEDINTMAP1_FIEN1_WIDTH        (1U)
#define AES_ACCEL_FEEDINTMAP1_FIEN1(x)           (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_FEEDINTMAP1_FIEN1_SHIFT)) & AES_ACCEL_FEEDINTMAP1_FIEN1_MASK)

#define AES_ACCEL_FEEDINTMAP1_FIEN9_MASK         (0x2U)
#define AES_ACCEL_FEEDINTMAP1_FIEN9_SHIFT        (1U)
#define AES_ACCEL_FEEDINTMAP1_FIEN9_WIDTH        (1U)
#define AES_ACCEL_FEEDINTMAP1_FIEN9(x)           (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_FEEDINTMAP1_FIEN9_SHIFT)) & AES_ACCEL_FEEDINTMAP1_FIEN9_MASK)

#define AES_ACCEL_FEEDINTMAP1_FIEN17_MASK        (0x4U)
#define AES_ACCEL_FEEDINTMAP1_FIEN17_SHIFT       (2U)
#define AES_ACCEL_FEEDINTMAP1_FIEN17_WIDTH       (1U)
#define AES_ACCEL_FEEDINTMAP1_FIEN17(x)          (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_FEEDINTMAP1_FIEN17_SHIFT)) & AES_ACCEL_FEEDINTMAP1_FIEN17_MASK)

#define AES_ACCEL_FEEDINTMAP1_FIEN25_MASK        (0x8U)
#define AES_ACCEL_FEEDINTMAP1_FIEN25_SHIFT       (3U)
#define AES_ACCEL_FEEDINTMAP1_FIEN25_WIDTH       (1U)
#define AES_ACCEL_FEEDINTMAP1_FIEN25(x)          (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_FEEDINTMAP1_FIEN25_SHIFT)) & AES_ACCEL_FEEDINTMAP1_FIEN25_MASK)
/*! @} */

/*! @name RESULTINTMAP1 - RESULTINTMAP */
/*! @{ */

#define AES_ACCEL_RESULTINTMAP1_RIEN1_MASK       (0x1U)
#define AES_ACCEL_RESULTINTMAP1_RIEN1_SHIFT      (0U)
#define AES_ACCEL_RESULTINTMAP1_RIEN1_WIDTH      (1U)
#define AES_ACCEL_RESULTINTMAP1_RIEN1(x)         (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_RESULTINTMAP1_RIEN1_SHIFT)) & AES_ACCEL_RESULTINTMAP1_RIEN1_MASK)

#define AES_ACCEL_RESULTINTMAP1_RIEN9_MASK       (0x2U)
#define AES_ACCEL_RESULTINTMAP1_RIEN9_SHIFT      (1U)
#define AES_ACCEL_RESULTINTMAP1_RIEN9_WIDTH      (1U)
#define AES_ACCEL_RESULTINTMAP1_RIEN9(x)         (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_RESULTINTMAP1_RIEN9_SHIFT)) & AES_ACCEL_RESULTINTMAP1_RIEN9_MASK)

#define AES_ACCEL_RESULTINTMAP1_RIEN17_MASK      (0x4U)
#define AES_ACCEL_RESULTINTMAP1_RIEN17_SHIFT     (2U)
#define AES_ACCEL_RESULTINTMAP1_RIEN17_WIDTH     (1U)
#define AES_ACCEL_RESULTINTMAP1_RIEN17(x)        (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_RESULTINTMAP1_RIEN17_SHIFT)) & AES_ACCEL_RESULTINTMAP1_RIEN17_MASK)
/*! @} */

/*! @name LEN2 - LEN */
/*! @{ */

#define AES_ACCEL_LEN2_TLEN_MASK                 (0x7FFFFU)
#define AES_ACCEL_LEN2_TLEN_SHIFT                (0U)
#define AES_ACCEL_LEN2_TLEN_WIDTH                (19U)
#define AES_ACCEL_LEN2_TLEN(x)                   (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_LEN2_TLEN_SHIFT)) & AES_ACCEL_LEN2_TLEN_MASK)
/*! @} */

/*! @name AILEN2 - AAD/IV length */
/*! @{ */

#define AES_ACCEL_AILEN2_AAD_MASK                (0x7FFFFU)
#define AES_ACCEL_AILEN2_AAD_SHIFT               (0U)
#define AES_ACCEL_AILEN2_AAD_WIDTH               (19U)
#define AES_ACCEL_AILEN2_AAD(x)                  (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_AILEN2_AAD_SHIFT)) & AES_ACCEL_AILEN2_AAD_MASK)

#define AES_ACCEL_AILEN2_IVLEN_MASK              (0x7F000000U)
#define AES_ACCEL_AILEN2_IVLEN_SHIFT             (24U)
#define AES_ACCEL_AILEN2_IVLEN_WIDTH             (7U)
#define AES_ACCEL_AILEN2_IVLEN(x)                (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_AILEN2_IVLEN_SHIFT)) & AES_ACCEL_AILEN2_IVLEN_MASK)
/*! @} */

/*! @name CRYPT2 - CRYPT */
/*! @{ */

#define AES_ACCEL_CRYPT2_MASK_MASK               (0x7FU)
#define AES_ACCEL_CRYPT2_MASK_SHIFT              (0U)
#define AES_ACCEL_CRYPT2_MASK_WIDTH              (7U)
#define AES_ACCEL_CRYPT2_MASK(x)                 (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_CRYPT2_MASK_SHIFT)) & AES_ACCEL_CRYPT2_MASK_MASK)

#define AES_ACCEL_CRYPT2_CMODE_MASK              (0xF00U)
#define AES_ACCEL_CRYPT2_CMODE_SHIFT             (8U)
#define AES_ACCEL_CRYPT2_CMODE_WIDTH             (4U)
#define AES_ACCEL_CRYPT2_CMODE(x)                (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_CRYPT2_CMODE_SHIFT)) & AES_ACCEL_CRYPT2_CMODE_MASK)

#define AES_ACCEL_CRYPT2_CO_MASK                 (0x3000U)
#define AES_ACCEL_CRYPT2_CO_SHIFT                (12U)
#define AES_ACCEL_CRYPT2_CO_WIDTH                (2U)
#define AES_ACCEL_CRYPT2_CO(x)                   (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_CRYPT2_CO_SHIFT)) & AES_ACCEL_CRYPT2_CO_MASK)

#define AES_ACCEL_CRYPT2_KSLOT_MASK              (0x7F0000U)
#define AES_ACCEL_CRYPT2_KSLOT_SHIFT             (16U)
#define AES_ACCEL_CRYPT2_KSLOT_WIDTH             (7U)
#define AES_ACCEL_CRYPT2_KSLOT(x)                (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_CRYPT2_KSLOT_SHIFT)) & AES_ACCEL_CRYPT2_KSLOT_MASK)
/*! @} */

/*! @name OWNSTAT2 - OWN_Status */
/*! @{ */

#define AES_ACCEL_OWNSTAT2_DID_MASK              (0xFU)
#define AES_ACCEL_OWNSTAT2_DID_SHIFT             (0U)
#define AES_ACCEL_OWNSTAT2_DID_WIDTH             (4U)
#define AES_ACCEL_OWNSTAT2_DID(x)                (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_OWNSTAT2_DID_SHIFT)) & AES_ACCEL_OWNSTAT2_DID_MASK)

#define AES_ACCEL_OWNSTAT2_NS_MASK               (0x40U)
#define AES_ACCEL_OWNSTAT2_NS_SHIFT              (6U)
#define AES_ACCEL_OWNSTAT2_NS_WIDTH              (1U)
#define AES_ACCEL_OWNSTAT2_NS(x)                 (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_OWNSTAT2_NS_SHIFT)) & AES_ACCEL_OWNSTAT2_NS_MASK)

#define AES_ACCEL_OWNSTAT2_PRIV_MASK             (0x80U)
#define AES_ACCEL_OWNSTAT2_PRIV_SHIFT            (7U)
#define AES_ACCEL_OWNSTAT2_PRIV_WIDTH            (1U)
#define AES_ACCEL_OWNSTAT2_PRIV(x)               (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_OWNSTAT2_PRIV_SHIFT)) & AES_ACCEL_OWNSTAT2_PRIV_MASK)
/*! @} */

/*! @name TLVAL2 - Timer Load Value */
/*! @{ */

