rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_AES_ACCEL.h
#define AES_ACCEL_TLVAL2_TSV_MASK                (0xFFFFU)
#define AES_ACCEL_TLVAL2_TSV_SHIFT               (0U)
#define AES_ACCEL_TLVAL2_TSV_WIDTH               (16U)
#define AES_ACCEL_TLVAL2_TSV(x)                  (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_TLVAL2_TSV_SHIFT)) & AES_ACCEL_TLVAL2_TSV_MASK)
/*! @} */

/*! @name CVAL2 - Current Timer Value */
/*! @{ */

#define AES_ACCEL_CVAL2_TVL_MASK                 (0xFFFFU)
#define AES_ACCEL_CVAL2_TVL_SHIFT                (0U)
#define AES_ACCEL_CVAL2_TVL_WIDTH                (16U)
#define AES_ACCEL_CVAL2_TVL(x)                   (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_CVAL2_TVL_SHIFT)) & AES_ACCEL_CVAL2_TVL_MASK)
/*! @} */

/*! @name TCTRL2 - Timer Control */
/*! @{ */

#define AES_ACCEL_TCTRL2_TEN_MASK                (0x1U)
#define AES_ACCEL_TCTRL2_TEN_SHIFT               (0U)
#define AES_ACCEL_TCTRL2_TEN_WIDTH               (1U)
#define AES_ACCEL_TCTRL2_TEN(x)                  (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_TCTRL2_TEN_SHIFT)) & AES_ACCEL_TCTRL2_TEN_MASK)

#define AES_ACCEL_TCTRL2_TIE_MASK                (0x2U)
#define AES_ACCEL_TCTRL2_TIE_SHIFT               (1U)
#define AES_ACCEL_TCTRL2_TIE_WIDTH               (1U)
#define AES_ACCEL_TCTRL2_TIE(x)                  (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_TCTRL2_TIE_SHIFT)) & AES_ACCEL_TCTRL2_TIE_MASK)

#define AES_ACCEL_TCTRL2_FRZ_MASK                (0x4U)
#define AES_ACCEL_TCTRL2_FRZ_SHIFT               (2U)
#define AES_ACCEL_TCTRL2_FRZ_WIDTH               (1U)
#define AES_ACCEL_TCTRL2_FRZ(x)                  (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_TCTRL2_FRZ_SHIFT)) & AES_ACCEL_TCTRL2_FRZ_MASK)
/*! @} */

/*! @name TFLG2 - Timer Flag */
/*! @{ */

#define AES_ACCEL_TFLG2_TIF_MASK                 (0x1U)
#define AES_ACCEL_TFLG2_TIF_SHIFT                (0U)
#define AES_ACCEL_TFLG2_TIF_WIDTH                (1U)
#define AES_ACCEL_TFLG2_TIF(x)                   (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_TFLG2_TIF_SHIFT)) & AES_ACCEL_TFLG2_TIF_MASK)
/*! @} */

/*! @name FEEDINTMAP2 - FEEDINTMAP */
/*! @{ */

#define AES_ACCEL_FEEDINTMAP2_FIEN2_MASK         (0x1U)
#define AES_ACCEL_FEEDINTMAP2_FIEN2_SHIFT        (0U)
#define AES_ACCEL_FEEDINTMAP2_FIEN2_WIDTH        (1U)
#define AES_ACCEL_FEEDINTMAP2_FIEN2(x)           (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_FEEDINTMAP2_FIEN2_SHIFT)) & AES_ACCEL_FEEDINTMAP2_FIEN2_MASK)

#define AES_ACCEL_FEEDINTMAP2_FIEN10_MASK        (0x2U)
#define AES_ACCEL_FEEDINTMAP2_FIEN10_SHIFT       (1U)
#define AES_ACCEL_FEEDINTMAP2_FIEN10_WIDTH       (1U)
#define AES_ACCEL_FEEDINTMAP2_FIEN10(x)          (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_FEEDINTMAP2_FIEN10_SHIFT)) & AES_ACCEL_FEEDINTMAP2_FIEN10_MASK)

#define AES_ACCEL_FEEDINTMAP2_FIEN18_MASK        (0x4U)
#define AES_ACCEL_FEEDINTMAP2_FIEN18_SHIFT       (2U)
#define AES_ACCEL_FEEDINTMAP2_FIEN18_WIDTH       (1U)
#define AES_ACCEL_FEEDINTMAP2_FIEN18(x)          (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_FEEDINTMAP2_FIEN18_SHIFT)) & AES_ACCEL_FEEDINTMAP2_FIEN18_MASK)

#define AES_ACCEL_FEEDINTMAP2_FIEN26_MASK        (0x8U)
#define AES_ACCEL_FEEDINTMAP2_FIEN26_SHIFT       (3U)
#define AES_ACCEL_FEEDINTMAP2_FIEN26_WIDTH       (1U)
#define AES_ACCEL_FEEDINTMAP2_FIEN26(x)          (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_FEEDINTMAP2_FIEN26_SHIFT)) & AES_ACCEL_FEEDINTMAP2_FIEN26_MASK)
/*! @} */

/*! @name RESULTINTMAP2 - RESULTINTMAP */
/*! @{ */

#define AES_ACCEL_RESULTINTMAP2_RIEN2_MASK       (0x1U)
#define AES_ACCEL_RESULTINTMAP2_RIEN2_SHIFT      (0U)
#define AES_ACCEL_RESULTINTMAP2_RIEN2_WIDTH      (1U)
#define AES_ACCEL_RESULTINTMAP2_RIEN2(x)         (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_RESULTINTMAP2_RIEN2_SHIFT)) & AES_ACCEL_RESULTINTMAP2_RIEN2_MASK)

#define AES_ACCEL_RESULTINTMAP2_RIEN10_MASK      (0x2U)
#define AES_ACCEL_RESULTINTMAP2_RIEN10_SHIFT     (1U)
#define AES_ACCEL_RESULTINTMAP2_RIEN10_WIDTH     (1U)
#define AES_ACCEL_RESULTINTMAP2_RIEN10(x)        (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_RESULTINTMAP2_RIEN10_SHIFT)) & AES_ACCEL_RESULTINTMAP2_RIEN10_MASK)

#define AES_ACCEL_RESULTINTMAP2_RIEN18_MASK      (0x4U)
#define AES_ACCEL_RESULTINTMAP2_RIEN18_SHIFT     (2U)
#define AES_ACCEL_RESULTINTMAP2_RIEN18_WIDTH     (1U)
#define AES_ACCEL_RESULTINTMAP2_RIEN18(x)        (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_RESULTINTMAP2_RIEN18_SHIFT)) & AES_ACCEL_RESULTINTMAP2_RIEN18_MASK)
/*! @} */

/*! @name LEN3 - LEN */
/*! @{ */

#define AES_ACCEL_LEN3_TLEN_MASK                 (0x7FFFFU)
#define AES_ACCEL_LEN3_TLEN_SHIFT                (0U)
#define AES_ACCEL_LEN3_TLEN_WIDTH                (19U)
#define AES_ACCEL_LEN3_TLEN(x)                   (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_LEN3_TLEN_SHIFT)) & AES_ACCEL_LEN3_TLEN_MASK)
/*! @} */

/*! @name AILEN3 - AAD/IV length */
/*! @{ */

#define AES_ACCEL_AILEN3_AAD_MASK                (0x7FFFFU)
#define AES_ACCEL_AILEN3_AAD_SHIFT               (0U)
#define AES_ACCEL_AILEN3_AAD_WIDTH               (19U)
#define AES_ACCEL_AILEN3_AAD(x)                  (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_AILEN3_AAD_SHIFT)) & AES_ACCEL_AILEN3_AAD_MASK)

#define AES_ACCEL_AILEN3_IVLEN_MASK              (0x7F000000U)
#define AES_ACCEL_AILEN3_IVLEN_SHIFT             (24U)
#define AES_ACCEL_AILEN3_IVLEN_WIDTH             (7U)
#define AES_ACCEL_AILEN3_IVLEN(x)                (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_AILEN3_IVLEN_SHIFT)) & AES_ACCEL_AILEN3_IVLEN_MASK)
/*! @} */

/*! @name CRYPT3 - CRYPT */
/*! @{ */

#define AES_ACCEL_CRYPT3_MASK_MASK               (0x7FU)
#define AES_ACCEL_CRYPT3_MASK_SHIFT              (0U)
#define AES_ACCEL_CRYPT3_MASK_WIDTH              (7U)
#define AES_ACCEL_CRYPT3_MASK(x)                 (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_CRYPT3_MASK_SHIFT)) & AES_ACCEL_CRYPT3_MASK_MASK)

#define AES_ACCEL_CRYPT3_CMODE_MASK              (0xF00U)
#define AES_ACCEL_CRYPT3_CMODE_SHIFT             (8U)
#define AES_ACCEL_CRYPT3_CMODE_WIDTH             (4U)
#define AES_ACCEL_CRYPT3_CMODE(x)                (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_CRYPT3_CMODE_SHIFT)) & AES_ACCEL_CRYPT3_CMODE_MASK)

#define AES_ACCEL_CRYPT3_CO_MASK                 (0x3000U)
#define AES_ACCEL_CRYPT3_CO_SHIFT                (12U)
#define AES_ACCEL_CRYPT3_CO_WIDTH                (2U)
#define AES_ACCEL_CRYPT3_CO(x)                   (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_CRYPT3_CO_SHIFT)) & AES_ACCEL_CRYPT3_CO_MASK)

#define AES_ACCEL_CRYPT3_KSLOT_MASK              (0x7F0000U)
#define AES_ACCEL_CRYPT3_KSLOT_SHIFT             (16U)
#define AES_ACCEL_CRYPT3_KSLOT_WIDTH             (7U)
#define AES_ACCEL_CRYPT3_KSLOT(x)                (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_CRYPT3_KSLOT_SHIFT)) & AES_ACCEL_CRYPT3_KSLOT_MASK)
/*! @} */

