rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_AES_ACCEL.h
/*! @name OWNSTAT3 - OWN_Status */
/*! @{ */

#define AES_ACCEL_OWNSTAT3_DID_MASK              (0xFU)
#define AES_ACCEL_OWNSTAT3_DID_SHIFT             (0U)
#define AES_ACCEL_OWNSTAT3_DID_WIDTH             (4U)
#define AES_ACCEL_OWNSTAT3_DID(x)                (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_OWNSTAT3_DID_SHIFT)) & AES_ACCEL_OWNSTAT3_DID_MASK)

#define AES_ACCEL_OWNSTAT3_NS_MASK               (0x40U)
#define AES_ACCEL_OWNSTAT3_NS_SHIFT              (6U)
#define AES_ACCEL_OWNSTAT3_NS_WIDTH              (1U)
#define AES_ACCEL_OWNSTAT3_NS(x)                 (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_OWNSTAT3_NS_SHIFT)) & AES_ACCEL_OWNSTAT3_NS_MASK)

#define AES_ACCEL_OWNSTAT3_PRIV_MASK             (0x80U)
#define AES_ACCEL_OWNSTAT3_PRIV_SHIFT            (7U)
#define AES_ACCEL_OWNSTAT3_PRIV_WIDTH            (1U)
#define AES_ACCEL_OWNSTAT3_PRIV(x)               (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_OWNSTAT3_PRIV_SHIFT)) & AES_ACCEL_OWNSTAT3_PRIV_MASK)
/*! @} */

/*! @name TLVAL3 - Timer Load Value */
/*! @{ */

#define AES_ACCEL_TLVAL3_TSV_MASK                (0xFFFFU)
#define AES_ACCEL_TLVAL3_TSV_SHIFT               (0U)
#define AES_ACCEL_TLVAL3_TSV_WIDTH               (16U)
#define AES_ACCEL_TLVAL3_TSV(x)                  (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_TLVAL3_TSV_SHIFT)) & AES_ACCEL_TLVAL3_TSV_MASK)
/*! @} */

/*! @name CVAL3 - Current Timer Value */
/*! @{ */

#define AES_ACCEL_CVAL3_TVL_MASK                 (0xFFFFU)
#define AES_ACCEL_CVAL3_TVL_SHIFT                (0U)
#define AES_ACCEL_CVAL3_TVL_WIDTH                (16U)
#define AES_ACCEL_CVAL3_TVL(x)                   (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_CVAL3_TVL_SHIFT)) & AES_ACCEL_CVAL3_TVL_MASK)
/*! @} */

/*! @name TCTRL3 - Timer Control */
/*! @{ */

#define AES_ACCEL_TCTRL3_TEN_MASK                (0x1U)
#define AES_ACCEL_TCTRL3_TEN_SHIFT               (0U)
#define AES_ACCEL_TCTRL3_TEN_WIDTH               (1U)
#define AES_ACCEL_TCTRL3_TEN(x)                  (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_TCTRL3_TEN_SHIFT)) & AES_ACCEL_TCTRL3_TEN_MASK)

#define AES_ACCEL_TCTRL3_TIE_MASK                (0x2U)
#define AES_ACCEL_TCTRL3_TIE_SHIFT               (1U)
#define AES_ACCEL_TCTRL3_TIE_WIDTH               (1U)
#define AES_ACCEL_TCTRL3_TIE(x)                  (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_TCTRL3_TIE_SHIFT)) & AES_ACCEL_TCTRL3_TIE_MASK)

#define AES_ACCEL_TCTRL3_FRZ_MASK                (0x4U)
#define AES_ACCEL_TCTRL3_FRZ_SHIFT               (2U)
#define AES_ACCEL_TCTRL3_FRZ_WIDTH               (1U)
#define AES_ACCEL_TCTRL3_FRZ(x)                  (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_TCTRL3_FRZ_SHIFT)) & AES_ACCEL_TCTRL3_FRZ_MASK)
/*! @} */

/*! @name TFLG3 - Timer Flag */
/*! @{ */

#define AES_ACCEL_TFLG3_TIF_MASK                 (0x1U)
#define AES_ACCEL_TFLG3_TIF_SHIFT                (0U)
#define AES_ACCEL_TFLG3_TIF_WIDTH                (1U)
#define AES_ACCEL_TFLG3_TIF(x)                   (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_TFLG3_TIF_SHIFT)) & AES_ACCEL_TFLG3_TIF_MASK)
/*! @} */

/*! @name FEEDINTMAP3 - FEEDINTMAP */
/*! @{ */

#define AES_ACCEL_FEEDINTMAP3_FIEN3_MASK         (0x1U)
#define AES_ACCEL_FEEDINTMAP3_FIEN3_SHIFT        (0U)
#define AES_ACCEL_FEEDINTMAP3_FIEN3_WIDTH        (1U)
#define AES_ACCEL_FEEDINTMAP3_FIEN3(x)           (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_FEEDINTMAP3_FIEN3_SHIFT)) & AES_ACCEL_FEEDINTMAP3_FIEN3_MASK)

#define AES_ACCEL_FEEDINTMAP3_FIEN11_MASK        (0x2U)
#define AES_ACCEL_FEEDINTMAP3_FIEN11_SHIFT       (1U)
#define AES_ACCEL_FEEDINTMAP3_FIEN11_WIDTH       (1U)
#define AES_ACCEL_FEEDINTMAP3_FIEN11(x)          (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_FEEDINTMAP3_FIEN11_SHIFT)) & AES_ACCEL_FEEDINTMAP3_FIEN11_MASK)

#define AES_ACCEL_FEEDINTMAP3_FIEN19_MASK        (0x4U)
#define AES_ACCEL_FEEDINTMAP3_FIEN19_SHIFT       (2U)
#define AES_ACCEL_FEEDINTMAP3_FIEN19_WIDTH       (1U)
#define AES_ACCEL_FEEDINTMAP3_FIEN19(x)          (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_FEEDINTMAP3_FIEN19_SHIFT)) & AES_ACCEL_FEEDINTMAP3_FIEN19_MASK)

#define AES_ACCEL_FEEDINTMAP3_FIEN27_MASK        (0x8U)
#define AES_ACCEL_FEEDINTMAP3_FIEN27_SHIFT       (3U)
#define AES_ACCEL_FEEDINTMAP3_FIEN27_WIDTH       (1U)
#define AES_ACCEL_FEEDINTMAP3_FIEN27(x)          (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_FEEDINTMAP3_FIEN27_SHIFT)) & AES_ACCEL_FEEDINTMAP3_FIEN27_MASK)
/*! @} */

/*! @name RESULTINTMAP3 - RESULTINTMAP */
/*! @{ */

#define AES_ACCEL_RESULTINTMAP3_RIEN3_MASK       (0x1U)
#define AES_ACCEL_RESULTINTMAP3_RIEN3_SHIFT      (0U)
#define AES_ACCEL_RESULTINTMAP3_RIEN3_WIDTH      (1U)
#define AES_ACCEL_RESULTINTMAP3_RIEN3(x)         (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_RESULTINTMAP3_RIEN3_SHIFT)) & AES_ACCEL_RESULTINTMAP3_RIEN3_MASK)

#define AES_ACCEL_RESULTINTMAP3_RIEN11_MASK      (0x2U)
#define AES_ACCEL_RESULTINTMAP3_RIEN11_SHIFT     (1U)
#define AES_ACCEL_RESULTINTMAP3_RIEN11_WIDTH     (1U)
#define AES_ACCEL_RESULTINTMAP3_RIEN11(x)        (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_RESULTINTMAP3_RIEN11_SHIFT)) & AES_ACCEL_RESULTINTMAP3_RIEN11_MASK)

#define AES_ACCEL_RESULTINTMAP3_RIEN19_MASK      (0x4U)
#define AES_ACCEL_RESULTINTMAP3_RIEN19_SHIFT     (2U)
#define AES_ACCEL_RESULTINTMAP3_RIEN19_WIDTH     (1U)
#define AES_ACCEL_RESULTINTMAP3_RIEN19(x)        (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_RESULTINTMAP3_RIEN19_SHIFT)) & AES_ACCEL_RESULTINTMAP3_RIEN19_MASK)
/*! @} */

/*! @name LEN4 - LEN */
/*! @{ */

#define AES_ACCEL_LEN4_TLEN_MASK                 (0x7FFFFU)
#define AES_ACCEL_LEN4_TLEN_SHIFT                (0U)
#define AES_ACCEL_LEN4_TLEN_WIDTH                (19U)
#define AES_ACCEL_LEN4_TLEN(x)                   (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_LEN4_TLEN_SHIFT)) & AES_ACCEL_LEN4_TLEN_MASK)
/*! @} */

/*! @name AILEN4 - AAD/IV length */
/*! @{ */

#define AES_ACCEL_AILEN4_AAD_MASK                (0x7FFFFU)
#define AES_ACCEL_AILEN4_AAD_SHIFT               (0U)
#define AES_ACCEL_AILEN4_AAD_WIDTH               (19U)
#define AES_ACCEL_AILEN4_AAD(x)                  (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_AILEN4_AAD_SHIFT)) & AES_ACCEL_AILEN4_AAD_MASK)

#define AES_ACCEL_AILEN4_IVLEN_MASK              (0x7F000000U)
#define AES_ACCEL_AILEN4_IVLEN_SHIFT             (24U)
#define AES_ACCEL_AILEN4_IVLEN_WIDTH             (7U)
#define AES_ACCEL_AILEN4_IVLEN(x)                (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_AILEN4_IVLEN_SHIFT)) & AES_ACCEL_AILEN4_IVLEN_MASK)
/*! @} */

/*! @name CRYPT4 - CRYPT */
/*! @{ */

