rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_AES_ACCEL.h
#define AES_ACCEL_CRYPT4_MASK_MASK               (0x7FU)
#define AES_ACCEL_CRYPT4_MASK_SHIFT              (0U)
#define AES_ACCEL_CRYPT4_MASK_WIDTH              (7U)
#define AES_ACCEL_CRYPT4_MASK(x)                 (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_CRYPT4_MASK_SHIFT)) & AES_ACCEL_CRYPT4_MASK_MASK)

#define AES_ACCEL_CRYPT4_CMODE_MASK              (0xF00U)
#define AES_ACCEL_CRYPT4_CMODE_SHIFT             (8U)
#define AES_ACCEL_CRYPT4_CMODE_WIDTH             (4U)
#define AES_ACCEL_CRYPT4_CMODE(x)                (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_CRYPT4_CMODE_SHIFT)) & AES_ACCEL_CRYPT4_CMODE_MASK)

#define AES_ACCEL_CRYPT4_CO_MASK                 (0x3000U)
#define AES_ACCEL_CRYPT4_CO_SHIFT                (12U)
#define AES_ACCEL_CRYPT4_CO_WIDTH                (2U)
#define AES_ACCEL_CRYPT4_CO(x)                   (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_CRYPT4_CO_SHIFT)) & AES_ACCEL_CRYPT4_CO_MASK)

#define AES_ACCEL_CRYPT4_KSLOT_MASK              (0x7F0000U)
#define AES_ACCEL_CRYPT4_KSLOT_SHIFT             (16U)
#define AES_ACCEL_CRYPT4_KSLOT_WIDTH             (7U)
#define AES_ACCEL_CRYPT4_KSLOT(x)                (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_CRYPT4_KSLOT_SHIFT)) & AES_ACCEL_CRYPT4_KSLOT_MASK)
/*! @} */

/*! @name OWNSTAT4 - OWN_Status */
/*! @{ */

#define AES_ACCEL_OWNSTAT4_DID_MASK              (0xFU)
#define AES_ACCEL_OWNSTAT4_DID_SHIFT             (0U)
#define AES_ACCEL_OWNSTAT4_DID_WIDTH             (4U)
#define AES_ACCEL_OWNSTAT4_DID(x)                (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_OWNSTAT4_DID_SHIFT)) & AES_ACCEL_OWNSTAT4_DID_MASK)

#define AES_ACCEL_OWNSTAT4_NS_MASK               (0x40U)
#define AES_ACCEL_OWNSTAT4_NS_SHIFT              (6U)
#define AES_ACCEL_OWNSTAT4_NS_WIDTH              (1U)
#define AES_ACCEL_OWNSTAT4_NS(x)                 (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_OWNSTAT4_NS_SHIFT)) & AES_ACCEL_OWNSTAT4_NS_MASK)

#define AES_ACCEL_OWNSTAT4_PRIV_MASK             (0x80U)
#define AES_ACCEL_OWNSTAT4_PRIV_SHIFT            (7U)
#define AES_ACCEL_OWNSTAT4_PRIV_WIDTH            (1U)
#define AES_ACCEL_OWNSTAT4_PRIV(x)               (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_OWNSTAT4_PRIV_SHIFT)) & AES_ACCEL_OWNSTAT4_PRIV_MASK)
/*! @} */

/*! @name TLVAL4 - Timer Load Value */
/*! @{ */

#define AES_ACCEL_TLVAL4_TSV_MASK                (0xFFFFU)
#define AES_ACCEL_TLVAL4_TSV_SHIFT               (0U)
#define AES_ACCEL_TLVAL4_TSV_WIDTH               (16U)
#define AES_ACCEL_TLVAL4_TSV(x)                  (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_TLVAL4_TSV_SHIFT)) & AES_ACCEL_TLVAL4_TSV_MASK)
/*! @} */

/*! @name CVAL4 - Current Timer Value */
/*! @{ */

#define AES_ACCEL_CVAL4_TVL_MASK                 (0xFFFFU)
#define AES_ACCEL_CVAL4_TVL_SHIFT                (0U)
#define AES_ACCEL_CVAL4_TVL_WIDTH                (16U)
#define AES_ACCEL_CVAL4_TVL(x)                   (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_CVAL4_TVL_SHIFT)) & AES_ACCEL_CVAL4_TVL_MASK)
/*! @} */

/*! @name TCTRL4 - Timer Control */
/*! @{ */

#define AES_ACCEL_TCTRL4_TEN_MASK                (0x1U)
#define AES_ACCEL_TCTRL4_TEN_SHIFT               (0U)
#define AES_ACCEL_TCTRL4_TEN_WIDTH               (1U)
#define AES_ACCEL_TCTRL4_TEN(x)                  (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_TCTRL4_TEN_SHIFT)) & AES_ACCEL_TCTRL4_TEN_MASK)

#define AES_ACCEL_TCTRL4_TIE_MASK                (0x2U)
#define AES_ACCEL_TCTRL4_TIE_SHIFT               (1U)
#define AES_ACCEL_TCTRL4_TIE_WIDTH               (1U)
#define AES_ACCEL_TCTRL4_TIE(x)                  (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_TCTRL4_TIE_SHIFT)) & AES_ACCEL_TCTRL4_TIE_MASK)

#define AES_ACCEL_TCTRL4_FRZ_MASK                (0x4U)
#define AES_ACCEL_TCTRL4_FRZ_SHIFT               (2U)
#define AES_ACCEL_TCTRL4_FRZ_WIDTH               (1U)
#define AES_ACCEL_TCTRL4_FRZ(x)                  (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_TCTRL4_FRZ_SHIFT)) & AES_ACCEL_TCTRL4_FRZ_MASK)
/*! @} */

/*! @name TFLG4 - Timer Flag */
/*! @{ */

#define AES_ACCEL_TFLG4_TIF_MASK                 (0x1U)
#define AES_ACCEL_TFLG4_TIF_SHIFT                (0U)
#define AES_ACCEL_TFLG4_TIF_WIDTH                (1U)
#define AES_ACCEL_TFLG4_TIF(x)                   (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_TFLG4_TIF_SHIFT)) & AES_ACCEL_TFLG4_TIF_MASK)
/*! @} */

/*! @name FEEDINTMAP4 - FEEDINTMAP */
/*! @{ */

#define AES_ACCEL_FEEDINTMAP4_FIEN4_MASK         (0x1U)
#define AES_ACCEL_FEEDINTMAP4_FIEN4_SHIFT        (0U)
#define AES_ACCEL_FEEDINTMAP4_FIEN4_WIDTH        (1U)
#define AES_ACCEL_FEEDINTMAP4_FIEN4(x)           (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_FEEDINTMAP4_FIEN4_SHIFT)) & AES_ACCEL_FEEDINTMAP4_FIEN4_MASK)

#define AES_ACCEL_FEEDINTMAP4_FIEN12_MASK        (0x2U)
#define AES_ACCEL_FEEDINTMAP4_FIEN12_SHIFT       (1U)
#define AES_ACCEL_FEEDINTMAP4_FIEN12_WIDTH       (1U)
#define AES_ACCEL_FEEDINTMAP4_FIEN12(x)          (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_FEEDINTMAP4_FIEN12_SHIFT)) & AES_ACCEL_FEEDINTMAP4_FIEN12_MASK)

#define AES_ACCEL_FEEDINTMAP4_FIEN20_MASK        (0x4U)
#define AES_ACCEL_FEEDINTMAP4_FIEN20_SHIFT       (2U)
#define AES_ACCEL_FEEDINTMAP4_FIEN20_WIDTH       (1U)
#define AES_ACCEL_FEEDINTMAP4_FIEN20(x)          (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_FEEDINTMAP4_FIEN20_SHIFT)) & AES_ACCEL_FEEDINTMAP4_FIEN20_MASK)

#define AES_ACCEL_FEEDINTMAP4_FIEN28_MASK        (0x8U)
#define AES_ACCEL_FEEDINTMAP4_FIEN28_SHIFT       (3U)
#define AES_ACCEL_FEEDINTMAP4_FIEN28_WIDTH       (1U)
#define AES_ACCEL_FEEDINTMAP4_FIEN28(x)          (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_FEEDINTMAP4_FIEN28_SHIFT)) & AES_ACCEL_FEEDINTMAP4_FIEN28_MASK)
/*! @} */

/*! @name RESULTINTMAP4 - RESULTINTMAP */
/*! @{ */

#define AES_ACCEL_RESULTINTMAP4_RIEN4_MASK       (0x1U)
#define AES_ACCEL_RESULTINTMAP4_RIEN4_SHIFT      (0U)
#define AES_ACCEL_RESULTINTMAP4_RIEN4_WIDTH      (1U)
#define AES_ACCEL_RESULTINTMAP4_RIEN4(x)         (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_RESULTINTMAP4_RIEN4_SHIFT)) & AES_ACCEL_RESULTINTMAP4_RIEN4_MASK)

#define AES_ACCEL_RESULTINTMAP4_RIEN12_MASK      (0x2U)
#define AES_ACCEL_RESULTINTMAP4_RIEN12_SHIFT     (1U)
#define AES_ACCEL_RESULTINTMAP4_RIEN12_WIDTH     (1U)
#define AES_ACCEL_RESULTINTMAP4_RIEN12(x)        (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_RESULTINTMAP4_RIEN12_SHIFT)) & AES_ACCEL_RESULTINTMAP4_RIEN12_MASK)

#define AES_ACCEL_RESULTINTMAP4_RIEN20_MASK      (0x4U)
#define AES_ACCEL_RESULTINTMAP4_RIEN20_SHIFT     (2U)
#define AES_ACCEL_RESULTINTMAP4_RIEN20_WIDTH     (1U)
#define AES_ACCEL_RESULTINTMAP4_RIEN20(x)        (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_RESULTINTMAP4_RIEN20_SHIFT)) & AES_ACCEL_RESULTINTMAP4_RIEN20_MASK)
/*! @} */

