rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_AES_ACCEL.h
/*! @name LEN5 - LEN */
/*! @{ */

#define AES_ACCEL_LEN5_TLEN_MASK                 (0x7FFFFU)
#define AES_ACCEL_LEN5_TLEN_SHIFT                (0U)
#define AES_ACCEL_LEN5_TLEN_WIDTH                (19U)
#define AES_ACCEL_LEN5_TLEN(x)                   (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_LEN5_TLEN_SHIFT)) & AES_ACCEL_LEN5_TLEN_MASK)
/*! @} */

/*! @name AILEN5 - AAD/IV length */
/*! @{ */

#define AES_ACCEL_AILEN5_AAD_MASK                (0x7FFFFU)
#define AES_ACCEL_AILEN5_AAD_SHIFT               (0U)
#define AES_ACCEL_AILEN5_AAD_WIDTH               (19U)
#define AES_ACCEL_AILEN5_AAD(x)                  (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_AILEN5_AAD_SHIFT)) & AES_ACCEL_AILEN5_AAD_MASK)

#define AES_ACCEL_AILEN5_IVLEN_MASK              (0x7F000000U)
#define AES_ACCEL_AILEN5_IVLEN_SHIFT             (24U)
#define AES_ACCEL_AILEN5_IVLEN_WIDTH             (7U)
#define AES_ACCEL_AILEN5_IVLEN(x)                (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_AILEN5_IVLEN_SHIFT)) & AES_ACCEL_AILEN5_IVLEN_MASK)
/*! @} */

/*! @name CRYPT5 - CRYPT */
/*! @{ */

#define AES_ACCEL_CRYPT5_MASK_MASK               (0x7FU)
#define AES_ACCEL_CRYPT5_MASK_SHIFT              (0U)
#define AES_ACCEL_CRYPT5_MASK_WIDTH              (7U)
#define AES_ACCEL_CRYPT5_MASK(x)                 (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_CRYPT5_MASK_SHIFT)) & AES_ACCEL_CRYPT5_MASK_MASK)

#define AES_ACCEL_CRYPT5_CMODE_MASK              (0xF00U)
#define AES_ACCEL_CRYPT5_CMODE_SHIFT             (8U)
#define AES_ACCEL_CRYPT5_CMODE_WIDTH             (4U)
#define AES_ACCEL_CRYPT5_CMODE(x)                (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_CRYPT5_CMODE_SHIFT)) & AES_ACCEL_CRYPT5_CMODE_MASK)

#define AES_ACCEL_CRYPT5_CO_MASK                 (0x3000U)
#define AES_ACCEL_CRYPT5_CO_SHIFT                (12U)
#define AES_ACCEL_CRYPT5_CO_WIDTH                (2U)
#define AES_ACCEL_CRYPT5_CO(x)                   (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_CRYPT5_CO_SHIFT)) & AES_ACCEL_CRYPT5_CO_MASK)

#define AES_ACCEL_CRYPT5_KSLOT_MASK              (0x7F0000U)
#define AES_ACCEL_CRYPT5_KSLOT_SHIFT             (16U)
#define AES_ACCEL_CRYPT5_KSLOT_WIDTH             (7U)
#define AES_ACCEL_CRYPT5_KSLOT(x)                (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_CRYPT5_KSLOT_SHIFT)) & AES_ACCEL_CRYPT5_KSLOT_MASK)
/*! @} */

/*! @name OWNSTAT5 - OWN_Status */
/*! @{ */

#define AES_ACCEL_OWNSTAT5_DID_MASK              (0xFU)
#define AES_ACCEL_OWNSTAT5_DID_SHIFT             (0U)
#define AES_ACCEL_OWNSTAT5_DID_WIDTH             (4U)
#define AES_ACCEL_OWNSTAT5_DID(x)                (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_OWNSTAT5_DID_SHIFT)) & AES_ACCEL_OWNSTAT5_DID_MASK)

#define AES_ACCEL_OWNSTAT5_NS_MASK               (0x40U)
#define AES_ACCEL_OWNSTAT5_NS_SHIFT              (6U)
#define AES_ACCEL_OWNSTAT5_NS_WIDTH              (1U)
#define AES_ACCEL_OWNSTAT5_NS(x)                 (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_OWNSTAT5_NS_SHIFT)) & AES_ACCEL_OWNSTAT5_NS_MASK)

#define AES_ACCEL_OWNSTAT5_PRIV_MASK             (0x80U)
#define AES_ACCEL_OWNSTAT5_PRIV_SHIFT            (7U)
#define AES_ACCEL_OWNSTAT5_PRIV_WIDTH            (1U)
#define AES_ACCEL_OWNSTAT5_PRIV(x)               (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_OWNSTAT5_PRIV_SHIFT)) & AES_ACCEL_OWNSTAT5_PRIV_MASK)
/*! @} */

/*! @name TLVAL5 - Timer Load Value */
/*! @{ */

#define AES_ACCEL_TLVAL5_TSV_MASK                (0xFFFFU)
#define AES_ACCEL_TLVAL5_TSV_SHIFT               (0U)
#define AES_ACCEL_TLVAL5_TSV_WIDTH               (16U)
#define AES_ACCEL_TLVAL5_TSV(x)                  (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_TLVAL5_TSV_SHIFT)) & AES_ACCEL_TLVAL5_TSV_MASK)
/*! @} */

/*! @name CVAL5 - Current Timer Value */
/*! @{ */

#define AES_ACCEL_CVAL5_TVL_MASK                 (0xFFFFU)
#define AES_ACCEL_CVAL5_TVL_SHIFT                (0U)
#define AES_ACCEL_CVAL5_TVL_WIDTH                (16U)
#define AES_ACCEL_CVAL5_TVL(x)                   (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_CVAL5_TVL_SHIFT)) & AES_ACCEL_CVAL5_TVL_MASK)
/*! @} */

/*! @name TCTRL5 - Timer Control */
/*! @{ */

#define AES_ACCEL_TCTRL5_TEN_MASK                (0x1U)
#define AES_ACCEL_TCTRL5_TEN_SHIFT               (0U)
#define AES_ACCEL_TCTRL5_TEN_WIDTH               (1U)
#define AES_ACCEL_TCTRL5_TEN(x)                  (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_TCTRL5_TEN_SHIFT)) & AES_ACCEL_TCTRL5_TEN_MASK)

#define AES_ACCEL_TCTRL5_TIE_MASK                (0x2U)
#define AES_ACCEL_TCTRL5_TIE_SHIFT               (1U)
#define AES_ACCEL_TCTRL5_TIE_WIDTH               (1U)
#define AES_ACCEL_TCTRL5_TIE(x)                  (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_TCTRL5_TIE_SHIFT)) & AES_ACCEL_TCTRL5_TIE_MASK)

#define AES_ACCEL_TCTRL5_FRZ_MASK                (0x4U)
#define AES_ACCEL_TCTRL5_FRZ_SHIFT               (2U)
#define AES_ACCEL_TCTRL5_FRZ_WIDTH               (1U)
#define AES_ACCEL_TCTRL5_FRZ(x)                  (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_TCTRL5_FRZ_SHIFT)) & AES_ACCEL_TCTRL5_FRZ_MASK)
/*! @} */

/*! @name TFLG5 - Timer Flag */
/*! @{ */

#define AES_ACCEL_TFLG5_TIF_MASK                 (0x1U)
#define AES_ACCEL_TFLG5_TIF_SHIFT                (0U)
#define AES_ACCEL_TFLG5_TIF_WIDTH                (1U)
#define AES_ACCEL_TFLG5_TIF(x)                   (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_TFLG5_TIF_SHIFT)) & AES_ACCEL_TFLG5_TIF_MASK)
/*! @} */

/*! @name FEEDINTMAP5 - FEEDINTMAP */
/*! @{ */

#define AES_ACCEL_FEEDINTMAP5_FIEN5_MASK         (0x1U)
#define AES_ACCEL_FEEDINTMAP5_FIEN5_SHIFT        (0U)
#define AES_ACCEL_FEEDINTMAP5_FIEN5_WIDTH        (1U)
#define AES_ACCEL_FEEDINTMAP5_FIEN5(x)           (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_FEEDINTMAP5_FIEN5_SHIFT)) & AES_ACCEL_FEEDINTMAP5_FIEN5_MASK)

#define AES_ACCEL_FEEDINTMAP5_FIEN13_MASK        (0x2U)
#define AES_ACCEL_FEEDINTMAP5_FIEN13_SHIFT       (1U)
#define AES_ACCEL_FEEDINTMAP5_FIEN13_WIDTH       (1U)
#define AES_ACCEL_FEEDINTMAP5_FIEN13(x)          (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_FEEDINTMAP5_FIEN13_SHIFT)) & AES_ACCEL_FEEDINTMAP5_FIEN13_MASK)

