rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_AES_ACCEL.h
#define AES_ACCEL_FEEDINTMAP5_FIEN21_MASK        (0x4U)
#define AES_ACCEL_FEEDINTMAP5_FIEN21_SHIFT       (2U)
#define AES_ACCEL_FEEDINTMAP5_FIEN21_WIDTH       (1U)
#define AES_ACCEL_FEEDINTMAP5_FIEN21(x)          (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_FEEDINTMAP5_FIEN21_SHIFT)) & AES_ACCEL_FEEDINTMAP5_FIEN21_MASK)

#define AES_ACCEL_FEEDINTMAP5_FIEN29_MASK        (0x8U)
#define AES_ACCEL_FEEDINTMAP5_FIEN29_SHIFT       (3U)
#define AES_ACCEL_FEEDINTMAP5_FIEN29_WIDTH       (1U)
#define AES_ACCEL_FEEDINTMAP5_FIEN29(x)          (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_FEEDINTMAP5_FIEN29_SHIFT)) & AES_ACCEL_FEEDINTMAP5_FIEN29_MASK)
/*! @} */

/*! @name RESULTINTMAP5 - RESULTINTMAP */
/*! @{ */

#define AES_ACCEL_RESULTINTMAP5_RIEN5_MASK       (0x1U)
#define AES_ACCEL_RESULTINTMAP5_RIEN5_SHIFT      (0U)
#define AES_ACCEL_RESULTINTMAP5_RIEN5_WIDTH      (1U)
#define AES_ACCEL_RESULTINTMAP5_RIEN5(x)         (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_RESULTINTMAP5_RIEN5_SHIFT)) & AES_ACCEL_RESULTINTMAP5_RIEN5_MASK)

#define AES_ACCEL_RESULTINTMAP5_RIEN13_MASK      (0x2U)
#define AES_ACCEL_RESULTINTMAP5_RIEN13_SHIFT     (1U)
#define AES_ACCEL_RESULTINTMAP5_RIEN13_WIDTH     (1U)
#define AES_ACCEL_RESULTINTMAP5_RIEN13(x)        (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_RESULTINTMAP5_RIEN13_SHIFT)) & AES_ACCEL_RESULTINTMAP5_RIEN13_MASK)

#define AES_ACCEL_RESULTINTMAP5_RIEN21_MASK      (0x4U)
#define AES_ACCEL_RESULTINTMAP5_RIEN21_SHIFT     (2U)
#define AES_ACCEL_RESULTINTMAP5_RIEN21_WIDTH     (1U)
#define AES_ACCEL_RESULTINTMAP5_RIEN21(x)        (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_RESULTINTMAP5_RIEN21_SHIFT)) & AES_ACCEL_RESULTINTMAP5_RIEN21_MASK)
/*! @} */

/*! @name LEN6 - LEN */
/*! @{ */

#define AES_ACCEL_LEN6_TLEN_MASK                 (0x7FFFFU)
#define AES_ACCEL_LEN6_TLEN_SHIFT                (0U)
#define AES_ACCEL_LEN6_TLEN_WIDTH                (19U)
#define AES_ACCEL_LEN6_TLEN(x)                   (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_LEN6_TLEN_SHIFT)) & AES_ACCEL_LEN6_TLEN_MASK)
/*! @} */

/*! @name AILEN6 - AAD/IV length */
/*! @{ */

#define AES_ACCEL_AILEN6_AAD_MASK                (0x7FFFFU)
#define AES_ACCEL_AILEN6_AAD_SHIFT               (0U)
#define AES_ACCEL_AILEN6_AAD_WIDTH               (19U)
#define AES_ACCEL_AILEN6_AAD(x)                  (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_AILEN6_AAD_SHIFT)) & AES_ACCEL_AILEN6_AAD_MASK)

#define AES_ACCEL_AILEN6_IVLEN_MASK              (0x7F000000U)
#define AES_ACCEL_AILEN6_IVLEN_SHIFT             (24U)
#define AES_ACCEL_AILEN6_IVLEN_WIDTH             (7U)
#define AES_ACCEL_AILEN6_IVLEN(x)                (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_AILEN6_IVLEN_SHIFT)) & AES_ACCEL_AILEN6_IVLEN_MASK)
/*! @} */

/*! @name CRYPT6 - CRYPT */
/*! @{ */

#define AES_ACCEL_CRYPT6_MASK_MASK               (0x7FU)
#define AES_ACCEL_CRYPT6_MASK_SHIFT              (0U)
#define AES_ACCEL_CRYPT6_MASK_WIDTH              (7U)
#define AES_ACCEL_CRYPT6_MASK(x)                 (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_CRYPT6_MASK_SHIFT)) & AES_ACCEL_CRYPT6_MASK_MASK)

#define AES_ACCEL_CRYPT6_CMODE_MASK              (0xF00U)
#define AES_ACCEL_CRYPT6_CMODE_SHIFT             (8U)
#define AES_ACCEL_CRYPT6_CMODE_WIDTH             (4U)
#define AES_ACCEL_CRYPT6_CMODE(x)                (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_CRYPT6_CMODE_SHIFT)) & AES_ACCEL_CRYPT6_CMODE_MASK)

#define AES_ACCEL_CRYPT6_CO_MASK                 (0x3000U)
#define AES_ACCEL_CRYPT6_CO_SHIFT                (12U)
#define AES_ACCEL_CRYPT6_CO_WIDTH                (2U)
#define AES_ACCEL_CRYPT6_CO(x)                   (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_CRYPT6_CO_SHIFT)) & AES_ACCEL_CRYPT6_CO_MASK)

#define AES_ACCEL_CRYPT6_KSLOT_MASK              (0x7F0000U)
#define AES_ACCEL_CRYPT6_KSLOT_SHIFT             (16U)
#define AES_ACCEL_CRYPT6_KSLOT_WIDTH             (7U)
#define AES_ACCEL_CRYPT6_KSLOT(x)                (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_CRYPT6_KSLOT_SHIFT)) & AES_ACCEL_CRYPT6_KSLOT_MASK)
/*! @} */

/*! @name OWNSTAT6 - OWN_Status */
/*! @{ */

#define AES_ACCEL_OWNSTAT6_DID_MASK              (0xFU)
#define AES_ACCEL_OWNSTAT6_DID_SHIFT             (0U)
#define AES_ACCEL_OWNSTAT6_DID_WIDTH             (4U)
#define AES_ACCEL_OWNSTAT6_DID(x)                (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_OWNSTAT6_DID_SHIFT)) & AES_ACCEL_OWNSTAT6_DID_MASK)

#define AES_ACCEL_OWNSTAT6_NS_MASK               (0x40U)
#define AES_ACCEL_OWNSTAT6_NS_SHIFT              (6U)
#define AES_ACCEL_OWNSTAT6_NS_WIDTH              (1U)
#define AES_ACCEL_OWNSTAT6_NS(x)                 (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_OWNSTAT6_NS_SHIFT)) & AES_ACCEL_OWNSTAT6_NS_MASK)

#define AES_ACCEL_OWNSTAT6_PRIV_MASK             (0x80U)
#define AES_ACCEL_OWNSTAT6_PRIV_SHIFT            (7U)
#define AES_ACCEL_OWNSTAT6_PRIV_WIDTH            (1U)
#define AES_ACCEL_OWNSTAT6_PRIV(x)               (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_OWNSTAT6_PRIV_SHIFT)) & AES_ACCEL_OWNSTAT6_PRIV_MASK)
/*! @} */

/*! @name TLVAL6 - Timer Load Value */
/*! @{ */

#define AES_ACCEL_TLVAL6_TSV_MASK                (0xFFFFU)
#define AES_ACCEL_TLVAL6_TSV_SHIFT               (0U)
#define AES_ACCEL_TLVAL6_TSV_WIDTH               (16U)
#define AES_ACCEL_TLVAL6_TSV(x)                  (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_TLVAL6_TSV_SHIFT)) & AES_ACCEL_TLVAL6_TSV_MASK)
/*! @} */

/*! @name CVAL6 - Current Timer Value */
/*! @{ */

#define AES_ACCEL_CVAL6_TVL_MASK                 (0xFFFFU)
#define AES_ACCEL_CVAL6_TVL_SHIFT                (0U)
#define AES_ACCEL_CVAL6_TVL_WIDTH                (16U)
#define AES_ACCEL_CVAL6_TVL(x)                   (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_CVAL6_TVL_SHIFT)) & AES_ACCEL_CVAL6_TVL_MASK)
/*! @} */

/*! @name TCTRL6 - Timer Control */
/*! @{ */

#define AES_ACCEL_TCTRL6_TEN_MASK                (0x1U)
#define AES_ACCEL_TCTRL6_TEN_SHIFT               (0U)
#define AES_ACCEL_TCTRL6_TEN_WIDTH               (1U)
#define AES_ACCEL_TCTRL6_TEN(x)                  (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_TCTRL6_TEN_SHIFT)) & AES_ACCEL_TCTRL6_TEN_MASK)

#define AES_ACCEL_TCTRL6_TIE_MASK                (0x2U)
#define AES_ACCEL_TCTRL6_TIE_SHIFT               (1U)
#define AES_ACCEL_TCTRL6_TIE_WIDTH               (1U)
#define AES_ACCEL_TCTRL6_TIE(x)                  (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_TCTRL6_TIE_SHIFT)) & AES_ACCEL_TCTRL6_TIE_MASK)

#define AES_ACCEL_TCTRL6_FRZ_MASK                (0x4U)
#define AES_ACCEL_TCTRL6_FRZ_SHIFT               (2U)
#define AES_ACCEL_TCTRL6_FRZ_WIDTH               (1U)
#define AES_ACCEL_TCTRL6_FRZ(x)                  (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_TCTRL6_FRZ_SHIFT)) & AES_ACCEL_TCTRL6_FRZ_MASK)
/*! @} */

/*! @name TFLG6 - Timer Flag */
/*! @{ */

