rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_AES_ACCEL.h
#define AES_ACCEL_TFLG6_TIF_MASK                 (0x1U)
#define AES_ACCEL_TFLG6_TIF_SHIFT                (0U)
#define AES_ACCEL_TFLG6_TIF_WIDTH                (1U)
#define AES_ACCEL_TFLG6_TIF(x)                   (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_TFLG6_TIF_SHIFT)) & AES_ACCEL_TFLG6_TIF_MASK)
/*! @} */

/*! @name FEEDINTMAP6 - FEEDINTMAP */
/*! @{ */

#define AES_ACCEL_FEEDINTMAP6_FIEN6_MASK         (0x1U)
#define AES_ACCEL_FEEDINTMAP6_FIEN6_SHIFT        (0U)
#define AES_ACCEL_FEEDINTMAP6_FIEN6_WIDTH        (1U)
#define AES_ACCEL_FEEDINTMAP6_FIEN6(x)           (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_FEEDINTMAP6_FIEN6_SHIFT)) & AES_ACCEL_FEEDINTMAP6_FIEN6_MASK)

#define AES_ACCEL_FEEDINTMAP6_FIEN14_MASK        (0x2U)
#define AES_ACCEL_FEEDINTMAP6_FIEN14_SHIFT       (1U)
#define AES_ACCEL_FEEDINTMAP6_FIEN14_WIDTH       (1U)
#define AES_ACCEL_FEEDINTMAP6_FIEN14(x)          (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_FEEDINTMAP6_FIEN14_SHIFT)) & AES_ACCEL_FEEDINTMAP6_FIEN14_MASK)

#define AES_ACCEL_FEEDINTMAP6_FIEN22_MASK        (0x4U)
#define AES_ACCEL_FEEDINTMAP6_FIEN22_SHIFT       (2U)
#define AES_ACCEL_FEEDINTMAP6_FIEN22_WIDTH       (1U)
#define AES_ACCEL_FEEDINTMAP6_FIEN22(x)          (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_FEEDINTMAP6_FIEN22_SHIFT)) & AES_ACCEL_FEEDINTMAP6_FIEN22_MASK)

#define AES_ACCEL_FEEDINTMAP6_FIEN30_MASK        (0x8U)
#define AES_ACCEL_FEEDINTMAP6_FIEN30_SHIFT       (3U)
#define AES_ACCEL_FEEDINTMAP6_FIEN30_WIDTH       (1U)
#define AES_ACCEL_FEEDINTMAP6_FIEN30(x)          (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_FEEDINTMAP6_FIEN30_SHIFT)) & AES_ACCEL_FEEDINTMAP6_FIEN30_MASK)
/*! @} */

/*! @name RESULTINTMAP6 - RESULTINTMAP */
/*! @{ */

#define AES_ACCEL_RESULTINTMAP6_RIEN6_MASK       (0x1U)
#define AES_ACCEL_RESULTINTMAP6_RIEN6_SHIFT      (0U)
#define AES_ACCEL_RESULTINTMAP6_RIEN6_WIDTH      (1U)
#define AES_ACCEL_RESULTINTMAP6_RIEN6(x)         (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_RESULTINTMAP6_RIEN6_SHIFT)) & AES_ACCEL_RESULTINTMAP6_RIEN6_MASK)

#define AES_ACCEL_RESULTINTMAP6_RIEN14_MASK      (0x2U)
#define AES_ACCEL_RESULTINTMAP6_RIEN14_SHIFT     (1U)
#define AES_ACCEL_RESULTINTMAP6_RIEN14_WIDTH     (1U)
#define AES_ACCEL_RESULTINTMAP6_RIEN14(x)        (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_RESULTINTMAP6_RIEN14_SHIFT)) & AES_ACCEL_RESULTINTMAP6_RIEN14_MASK)

#define AES_ACCEL_RESULTINTMAP6_RIEN22_MASK      (0x4U)
#define AES_ACCEL_RESULTINTMAP6_RIEN22_SHIFT     (2U)
#define AES_ACCEL_RESULTINTMAP6_RIEN22_WIDTH     (1U)
#define AES_ACCEL_RESULTINTMAP6_RIEN22(x)        (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_RESULTINTMAP6_RIEN22_SHIFT)) & AES_ACCEL_RESULTINTMAP6_RIEN22_MASK)
/*! @} */

/*! @name LEN7 - LEN */
/*! @{ */

#define AES_ACCEL_LEN7_TLEN_MASK                 (0x7FFFFU)
#define AES_ACCEL_LEN7_TLEN_SHIFT                (0U)
#define AES_ACCEL_LEN7_TLEN_WIDTH                (19U)
#define AES_ACCEL_LEN7_TLEN(x)                   (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_LEN7_TLEN_SHIFT)) & AES_ACCEL_LEN7_TLEN_MASK)
/*! @} */

/*! @name AILEN7 - AAD/IV length */
/*! @{ */

#define AES_ACCEL_AILEN7_AAD_MASK                (0x7FFFFU)
#define AES_ACCEL_AILEN7_AAD_SHIFT               (0U)
#define AES_ACCEL_AILEN7_AAD_WIDTH               (19U)
#define AES_ACCEL_AILEN7_AAD(x)                  (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_AILEN7_AAD_SHIFT)) & AES_ACCEL_AILEN7_AAD_MASK)

#define AES_ACCEL_AILEN7_IVLEN_MASK              (0x7F000000U)
#define AES_ACCEL_AILEN7_IVLEN_SHIFT             (24U)
#define AES_ACCEL_AILEN7_IVLEN_WIDTH             (7U)
#define AES_ACCEL_AILEN7_IVLEN(x)                (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_AILEN7_IVLEN_SHIFT)) & AES_ACCEL_AILEN7_IVLEN_MASK)
/*! @} */

/*! @name CRYPT7 - CRYPT */
/*! @{ */

#define AES_ACCEL_CRYPT7_MASK_MASK               (0x7FU)
#define AES_ACCEL_CRYPT7_MASK_SHIFT              (0U)
#define AES_ACCEL_CRYPT7_MASK_WIDTH              (7U)
#define AES_ACCEL_CRYPT7_MASK(x)                 (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_CRYPT7_MASK_SHIFT)) & AES_ACCEL_CRYPT7_MASK_MASK)

#define AES_ACCEL_CRYPT7_CMODE_MASK              (0xF00U)
#define AES_ACCEL_CRYPT7_CMODE_SHIFT             (8U)
#define AES_ACCEL_CRYPT7_CMODE_WIDTH             (4U)
#define AES_ACCEL_CRYPT7_CMODE(x)                (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_CRYPT7_CMODE_SHIFT)) & AES_ACCEL_CRYPT7_CMODE_MASK)

#define AES_ACCEL_CRYPT7_CO_MASK                 (0x3000U)
#define AES_ACCEL_CRYPT7_CO_SHIFT                (12U)
#define AES_ACCEL_CRYPT7_CO_WIDTH                (2U)
#define AES_ACCEL_CRYPT7_CO(x)                   (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_CRYPT7_CO_SHIFT)) & AES_ACCEL_CRYPT7_CO_MASK)

#define AES_ACCEL_CRYPT7_KSLOT_MASK              (0x7F0000U)
#define AES_ACCEL_CRYPT7_KSLOT_SHIFT             (16U)
#define AES_ACCEL_CRYPT7_KSLOT_WIDTH             (7U)
#define AES_ACCEL_CRYPT7_KSLOT(x)                (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_CRYPT7_KSLOT_SHIFT)) & AES_ACCEL_CRYPT7_KSLOT_MASK)
/*! @} */

/*! @name OWNSTAT7 - OWN_Status */
/*! @{ */

#define AES_ACCEL_OWNSTAT7_DID_MASK              (0xFU)
#define AES_ACCEL_OWNSTAT7_DID_SHIFT             (0U)
#define AES_ACCEL_OWNSTAT7_DID_WIDTH             (4U)
#define AES_ACCEL_OWNSTAT7_DID(x)                (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_OWNSTAT7_DID_SHIFT)) & AES_ACCEL_OWNSTAT7_DID_MASK)

#define AES_ACCEL_OWNSTAT7_NS_MASK               (0x40U)
#define AES_ACCEL_OWNSTAT7_NS_SHIFT              (6U)
#define AES_ACCEL_OWNSTAT7_NS_WIDTH              (1U)
#define AES_ACCEL_OWNSTAT7_NS(x)                 (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_OWNSTAT7_NS_SHIFT)) & AES_ACCEL_OWNSTAT7_NS_MASK)

#define AES_ACCEL_OWNSTAT7_PRIV_MASK             (0x80U)
#define AES_ACCEL_OWNSTAT7_PRIV_SHIFT            (7U)
#define AES_ACCEL_OWNSTAT7_PRIV_WIDTH            (1U)
#define AES_ACCEL_OWNSTAT7_PRIV(x)               (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_OWNSTAT7_PRIV_SHIFT)) & AES_ACCEL_OWNSTAT7_PRIV_MASK)
/*! @} */

/*! @name TLVAL7 - Timer Load Value */
/*! @{ */

#define AES_ACCEL_TLVAL7_TSV_MASK                (0xFFFFU)
#define AES_ACCEL_TLVAL7_TSV_SHIFT               (0U)
#define AES_ACCEL_TLVAL7_TSV_WIDTH               (16U)
#define AES_ACCEL_TLVAL7_TSV(x)                  (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_TLVAL7_TSV_SHIFT)) & AES_ACCEL_TLVAL7_TSV_MASK)
/*! @} */

/*! @name CVAL7 - Current Timer Value */
/*! @{ */

