rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_AES_ACCEL.h
#define AES_ACCEL_CVAL7_TVL_MASK                 (0xFFFFU)
#define AES_ACCEL_CVAL7_TVL_SHIFT                (0U)
#define AES_ACCEL_CVAL7_TVL_WIDTH                (16U)
#define AES_ACCEL_CVAL7_TVL(x)                   (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_CVAL7_TVL_SHIFT)) & AES_ACCEL_CVAL7_TVL_MASK)
/*! @} */

/*! @name TCTRL7 - Timer Control */
/*! @{ */

#define AES_ACCEL_TCTRL7_TEN_MASK                (0x1U)
#define AES_ACCEL_TCTRL7_TEN_SHIFT               (0U)
#define AES_ACCEL_TCTRL7_TEN_WIDTH               (1U)
#define AES_ACCEL_TCTRL7_TEN(x)                  (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_TCTRL7_TEN_SHIFT)) & AES_ACCEL_TCTRL7_TEN_MASK)

#define AES_ACCEL_TCTRL7_TIE_MASK                (0x2U)
#define AES_ACCEL_TCTRL7_TIE_SHIFT               (1U)
#define AES_ACCEL_TCTRL7_TIE_WIDTH               (1U)
#define AES_ACCEL_TCTRL7_TIE(x)                  (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_TCTRL7_TIE_SHIFT)) & AES_ACCEL_TCTRL7_TIE_MASK)

#define AES_ACCEL_TCTRL7_FRZ_MASK                (0x4U)
#define AES_ACCEL_TCTRL7_FRZ_SHIFT               (2U)
#define AES_ACCEL_TCTRL7_FRZ_WIDTH               (1U)
#define AES_ACCEL_TCTRL7_FRZ(x)                  (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_TCTRL7_FRZ_SHIFT)) & AES_ACCEL_TCTRL7_FRZ_MASK)
/*! @} */

/*! @name TFLG7 - Timer Flag */
/*! @{ */

#define AES_ACCEL_TFLG7_TIF_MASK                 (0x1U)
#define AES_ACCEL_TFLG7_TIF_SHIFT                (0U)
#define AES_ACCEL_TFLG7_TIF_WIDTH                (1U)
#define AES_ACCEL_TFLG7_TIF(x)                   (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_TFLG7_TIF_SHIFT)) & AES_ACCEL_TFLG7_TIF_MASK)
/*! @} */

/*! @name FEEDINTMAP7 - FEEDINTMAP */
/*! @{ */

#define AES_ACCEL_FEEDINTMAP7_FIEN7_MASK         (0x1U)
#define AES_ACCEL_FEEDINTMAP7_FIEN7_SHIFT        (0U)
#define AES_ACCEL_FEEDINTMAP7_FIEN7_WIDTH        (1U)
#define AES_ACCEL_FEEDINTMAP7_FIEN7(x)           (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_FEEDINTMAP7_FIEN7_SHIFT)) & AES_ACCEL_FEEDINTMAP7_FIEN7_MASK)

#define AES_ACCEL_FEEDINTMAP7_FIEN15_MASK        (0x2U)
#define AES_ACCEL_FEEDINTMAP7_FIEN15_SHIFT       (1U)
#define AES_ACCEL_FEEDINTMAP7_FIEN15_WIDTH       (1U)
#define AES_ACCEL_FEEDINTMAP7_FIEN15(x)          (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_FEEDINTMAP7_FIEN15_SHIFT)) & AES_ACCEL_FEEDINTMAP7_FIEN15_MASK)

#define AES_ACCEL_FEEDINTMAP7_FIEN23_MASK        (0x4U)
#define AES_ACCEL_FEEDINTMAP7_FIEN23_SHIFT       (2U)
#define AES_ACCEL_FEEDINTMAP7_FIEN23_WIDTH       (1U)
#define AES_ACCEL_FEEDINTMAP7_FIEN23(x)          (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_FEEDINTMAP7_FIEN23_SHIFT)) & AES_ACCEL_FEEDINTMAP7_FIEN23_MASK)

#define AES_ACCEL_FEEDINTMAP7_FIEN31_MASK        (0x8U)
#define AES_ACCEL_FEEDINTMAP7_FIEN31_SHIFT       (3U)
#define AES_ACCEL_FEEDINTMAP7_FIEN31_WIDTH       (1U)
#define AES_ACCEL_FEEDINTMAP7_FIEN31(x)          (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_FEEDINTMAP7_FIEN31_SHIFT)) & AES_ACCEL_FEEDINTMAP7_FIEN31_MASK)
/*! @} */

/*! @name RESULTINTMAP7 - RESULTINTMAP */
/*! @{ */

#define AES_ACCEL_RESULTINTMAP7_RIEN7_MASK       (0x1U)
#define AES_ACCEL_RESULTINTMAP7_RIEN7_SHIFT      (0U)
#define AES_ACCEL_RESULTINTMAP7_RIEN7_WIDTH      (1U)
#define AES_ACCEL_RESULTINTMAP7_RIEN7(x)         (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_RESULTINTMAP7_RIEN7_SHIFT)) & AES_ACCEL_RESULTINTMAP7_RIEN7_MASK)

#define AES_ACCEL_RESULTINTMAP7_RIEN15_MASK      (0x2U)
#define AES_ACCEL_RESULTINTMAP7_RIEN15_SHIFT     (1U)
#define AES_ACCEL_RESULTINTMAP7_RIEN15_WIDTH     (1U)
#define AES_ACCEL_RESULTINTMAP7_RIEN15(x)        (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_RESULTINTMAP7_RIEN15_SHIFT)) & AES_ACCEL_RESULTINTMAP7_RIEN15_MASK)

#define AES_ACCEL_RESULTINTMAP7_RIEN23_MASK      (0x4U)
#define AES_ACCEL_RESULTINTMAP7_RIEN23_SHIFT     (2U)
#define AES_ACCEL_RESULTINTMAP7_RIEN23_WIDTH     (1U)
#define AES_ACCEL_RESULTINTMAP7_RIEN23(x)        (((uint32_t)(((uint32_t)(x)) << AES_ACCEL_RESULTINTMAP7_RIEN23_SHIFT)) & AES_ACCEL_RESULTINTMAP7_RIEN23_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group AES_ACCEL_Register_Masks */

/*!
 * @}
 */ /* end of group AES_ACCEL_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K388_AES_ACCEL_H_) */
